import numpy as np

##Задача 1. Проверьте, существует ли связь между данными, приведёнными в таблице.Выполните задание с помощью библиотеки numpy.

#[56, 37, 48, 45, 46, 43, 41, 45, 47, 48, 57, 63]
#[66, 46, 46, 54, 57, 51, 52, 54, 57, 54, 68, 72]
#[89, 67, 65, 77, 79, 68, 74, 75, 77, 77, 91, 96]

nums1=[56, 37, 48, 45, 46, 43, 41, 45, 47, 48, 57, 63]
nums2=[66, 46, 46, 54, 57, 51, 52, 54, 57, 54, 68, 72]
nums3=[89, 67, 65, 77, 79, 68, 74, 75, 77, 77, 91, 96]

matrix=[nums1, nums2, nums3]

#коэффициенты корреляции между данными 
result=np.corrcoef(matrix)

print(result)